package bg.tu_varna.sit.a1.f21621551;
public class App {
    public static void main(String[] args) throws Exception {
        System.out.println("Hello, World!");
        
        /*
        Използвайте Bridge и Decorator pattern, за да разработите система за управление на ресторант.
        Ресторанта има различни видове ястия - скара, пици, салати. 
        Направете два вида скара, два вида пица и два вида салата.
        Към всяко ястие може да се добавят множество екстри - сирене, бекон, маслини.
        Да се състави поръчка и да се изведе крайния резултат от поръчката, 
        като се включат всички добавени екстри за всички ястия. */
    }
}
